import React from 'react';
import styles from './Agreement.less';

export default class Privacy extends React.PureComponent {
  shouldComponentUpdate() {
    return false;
  }

  render() {
    return
    (
      <div>
        <h4 className={styles.title}>用户注册协议</h4>
        <div className={styles.content}>
          <h5>一．总则</h5>
          <p>（一 ）浙江健康导航（别名：浙江预约挂号，以下简称：浙江健康导航）是浙江省卫生健康委员会官方授权的全省统一卫生健康信息服务门户。</p>
          <p>（二） 会员服务秉承以下宗旨：为成为会员的用户提供各种更完善的网上网下增值服务，促进会员与医院、会员与浙江健康导航之间的相互交流。</p>
          <p>（三） 关于会员的隐私及权利保障相关信息可以阅读《隐私政策》予以进一步了解。</p>
          <h5>二．获得会员服务的程序</h5>
          <p>（一）成为会员的方法</p>
          <p>1.用户可通过12580网站（http:\/\/www.zj12580.cn\/）预约挂号频道 、拨打12580客服电话或使用手机wap和客户端、小程序进行注册。</p>
          <p>2.在用户使用浙江健康导航网站加入会员时,须阅读并确认相关的注册及用户协议和使用方法。</p>
          <p>（二）用户通过网络填写并提交注册表，表中所填写的内容与个人资料必须真实有效，否则浙江健康导航有权拒绝其申请或撤销其会员资格，并不予任何赔偿或退还会员费。用户的个人资料发生变化，应及时修改注册的个人资料，否则由此造成的会员权力不能全面有效行使的责任由会员自己承担，浙江健康导航有权因此取销其会员资格，并不予任何赔偿。</p>
          <p>（三）会员注册成功后会获得浙江健康导航用户名和密码，系统将自动开通会员服务。</p>
          <h5>四．会员资格的有关规定</h5>
          <p>（一）会员可优先参加由浙江健康导航组织的活动并享有由浙江健康导航提供的各项服务。</p>
          <p>（二）会员取消会员服务或终止会员资格后因会员个人行为产生的纠纷，浙江健康导航平台将不承担任何责任。</p>
          <p>（三）若会员持续违反本章程尤其是第五款会员守则的规定，或浙江健康导航认为会员行为有损浙江健康导航或他人的声誉及利益，浙江健康导航有权取消该会员的会员资格而无须给予任何补偿。</p>
          <p>（四）会员有权利不参加浙江健康导航的活动。</p>
          <h5>五．会员守则</h5>
          <p>（一）确保注册资料的真实性。在用户申请会员服务填写注册资料时，用户要确保所填写的信息是真实有效的。如果因注册信息不真实而引起的问题，并对问题发生所带来的后果，浙江健康导航不负任何责任。</p>
          <p>（二）会员平等享有会员的权利，同时遵守会员服务的各项规章制度。</p>
          <p>（三）不得盗用其他用户进行会员注册或使用，一旦发现，浙江健康导航将没收该用户名并取消其会员资格而无须给予任何补偿。</p>
          <p>（四）会员使用浙江健康导航会员服务的规定</p>
          <p>1．必须遵守浙江健康导航用户协议。</p>
          <p>2．必须遵守浙江省医院预约诊疗服务平台用户守则，如有违反而足以影响到浙江健康导航声誉者，则停止其相应的权利，直至取消其会员资格。</p>
          <p>3．任何会员不得使用带有非法、淫秽、污辱或人身攻击的含义污辱或人身攻击的呢称和签名档，一经发现，立即通告批评，之后仍不修改者立即取消其会员资格，并不给与任何赔偿。</p>
          <p>（五）会员不得私自以浙江健康导航名义对外进行任何形式的承诺，举办未经浙江健康导航允许的活动，如有损害浙江健康导航名誉，商业利益等一切有危害性的行为发生，浙江健康导航有权取消该会员的资格，并保留进一步追究该行为法律责任的权利。</p>
          <h5>六．章程的修改</h5>
          <p>（一）浙江健康导航有权视需要修改章程。</p>
          <p>（二）浙江健康导航对会员服务章程进行修改，会以通告形式公布于浙江健康导航主站重要页面上，一经公布即视为通知会员 。</p>
          <p>（三）会员对本章程的修改有任何异议，可自动放弃会员资格。</p>
          <h5>七．隐私条款</h5>
          <p>尊重会员个人隐私是浙江健康导航的责任，浙江健康导航在未经会员的授权时不得公开、编辑或透露其注册资料及保存的非公开内容。由于法律需要等原因除外。详情可以阅读《隐私政策》中的详细说明。</p>
          <h5>八．浙江健康导航将采用数据加密存储及采用安全的通讯协议（如SSL）传输用户的信息等方式保障会员的信息安全，会员资料和用户名、密码的安全性由会员自己负责。</h5>
          <h5>九．会员服务的通知和公告办法 会员服务的通知和公告将通过以下形式之一或多种形式对会员发布：</h5>
          <p>1、向会员注册使用的手机下发通知短信；</p>
          <p>2、浙江健康导航主页的公告专栏；</p>
          <p>3、会员服务栏目。</p>
          <p>章程的修改，服务变更，或其他重要事件的通告都会以此形式进行。</p>
          <h5>十．责任声明</h5>
          <p>（一）凡参加浙江健康导航组织的活动或使用由浙江健康导航提供的各项优惠及增值服务会员，如遭受任何人身或财务的损失、损害或伤害，不论原因为何，浙江健康导航不负责任，会员可以直接向产品服务的提供商提出权利要求。</p>
          <p>（二）会员须对其自身及其所邀请的宾客在参加浙江健康导航组织的活动或使用由浙江健康导航提供的各项服务时的一切行为、行动及违法、违规或疏忽行为（不论是否故意）负全部责任。</p>
          <p>（三）如本服务的系统发生故障影响到会员服务的正常运行，浙江健康导航承诺在第一时间内与相关单位配合，及时处理进行修复。但用户因此而产生的经济损失，本平台不承担责任。</p>
          <p>（四）用户因第叁方如电信部门的通讯线路故障、通讯技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力原因而产生的对会员造成的损失，浙江健康导航不负责任，并不予以亦无法补偿。</p>
          <h5>十一．会员服务的终止</h5>
          <p>（一）因发生浙江健康导航不可抗拒的事由，如政府行为、不可抗力，导致会员服务无法继续，浙江健康导航会以最快的速度通知会员，但不承担由此对会员造成的任何损失。</p>
          <p>（二）如会员持续违反本会员服务章程，浙江健康导航有权利取消其会员资格。会员或浙江健康导航可随时根据实际情况中断一项或多项会员服务。会员对后来的条款修改有异议，或对浙江健康导航的服务不满，可以行使如下权利：</p>
          <p>1．停止使用会员服务；</p><p>2．通告浙江健康导航终止对该会员的服务。 结束会员服务后，会员使用会员服务的权利马上终止，浙江健康导航也没有义务传送任何未处理的信息或未完成的服务给会员或第三方。</p>
          <h5>十二． 与相关法律的关系</h5>
          <p>本章程遵循中华人民共和国相关的法律法规，与中华人民共和国的法律解释相一致。会员和浙江健康导航一致同意服从高等法院所有管辖。如发生本章程与中华人民共和国现行法律法规相抵触时，则这些条款将完全按照法律规定重新解释，但不影响本服务条款的整体效力。</p>
          <p>浙江健康导航平台</p>
        </div>
      </div>
    )
  }
}